#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");
	/*int N;
	cin >> N;
	for (int i = 1; i <= N; i += 1) {
		cout << '@';
	}*/
	//While 1 дано два целых положительных числа а и б(a < b).вывести из этого диапозона все числа в пор€дке убывани€
	/*int a, b, i;
	cin >> a >> b;
	i = b;
	while (i >= a) {
		cout << i << " ";
		i -= 1;
	}*/
	//For 2 дано два целых положительных числа а и б(a < b). найти сумму четных чисел из этого диапозона
	/*int a, b, summa = 0;
	cin >> a >> b;
	for (int i = a; i <= b; i++) {
		if (i % 2 == 0) {
			summa += i;
		}
	}
	cout << summa << endl;*/
	//While 2 дано два целых положительных числа а и б(a < b). произведение тех чисел не дел€тс€ на п€ть
	//int i = 1, N, prois = 1;
	//cin >> N;
	//while (i <= N) {
	//	if (i % 5 != 0) {
	//		prois *= i;  // p = p * i;
	//	}
	//	i++;
	//}
	//cout << prois << endl;
	//10. ƒаны натуральные числа от 1 до 50. Ќайти сумму тех из них, которые дел€тс€ на 5 или на 7.
	/*int i = 1, summa = 0;
	while (i <= 50) {
		if (i % 5 == 0 || i % 7 == 0) {
			summa = summa + i;
		}
		i += 1;
	}
	cout << summa << " ";*/
	//11. Ќапечатать те из двузначных чисел которые дел€тс€ на 4,
	//но не дел€тс€ на 6.
	/*int i = 10;
	while (i <= 99) {
		if (i % 4 == 0 && i % 6 != 0) {
			cout << i << " ";
		}
		i++;
	}*/
	//12.Ќайти произведение двузначных нечетных чисел кратных 13.
	/*int prois = 1;
	for (int i = 11; i <= 99; i = i + 2) {
		if (i % 13 == 0) {
			prois = prois * i;
		}
	}
	cout << prois << " ";*/
	//13. Ќайти сумму чисел от 100 до 200 кратных 17.
	/*int summa = 0;
	for (int i = 100; i <= 200; i = i + 1) {
		if (i % 17 == 0) {
			summa = summa + i;
		}
	}
	cout << summa << " ";*/
	//14. —оставьте программу,
	//котора€ вычисл€ет сумму квадратов чисел от 1 до введенного вами целого числа N.
	int i = 1, N, summa = 0;
	cin >> N;
	while (i <= N) {
		summa = summa + i * i;
		i += 1;
	}
	cout << summa << " ";

}